{
    "video_metadata": {
        "filename": "video_1.mp4",
        "total_duration": 28.166666666666668,
        "total_chunks": 3,
        "chunk_duration": 10,
        "anomalous_chunks_count": 3
    },
    "anomalous_chunks": [
        {
            "overall_scene": {
                "location": "A street corner in a town or city, viewed from a building-mounted surveillance camera.",
                "time_of_day": "Night",
                "people_count": 2,
                "objects_detected": [
                    "car",
                    "street",
                    "sidewalk",
                    "trash can",
                    "streetlights",
                    "buildings",
                    "street sign"
                ],
                "activity_summary": "A vehicle passes by, followed by a physical altercation between two individuals on the sidewalk, where one person is knocked to the ground.",
                "description": "The surveillance footage, captured by 'Camera 05' during the early morning hours of Sunday, October 4th, 2015, shows a street corner illuminated by artificial lighting. The scene is initially quiet, with a single dark-colored vehicle passing through the intersection. Shortly after, two individuals appear on the far sidewalk. A violent interaction occurs where one person forcefully shoves or strikes the other, causing them to fall heavily onto the pavement. The aggressor then stands over the fallen individual. The event takes place in an otherwise deserted public area.",
                "actors": [
                    "Person initiating physical contact",
                    "Person falling to the ground"
                ],
                "suspicious_objects": [],
                "critical_level": "High",
                "chunk_time_range": "0.0s - 10.0s",
                "anomaly_reason": "Detection of a violent physical altercation. One individual is observed forcefully knocking another person to the ground, indicating a potential assault."
            },
            "chunk_metadata": {
                "chunk_index": 0,
                "start_time": 0.0,
                "end_time": 10.0,
                "duration": 10.0
            }
        },
        {
            "overall_scene": {
                "location": "Sidewalk and street corner outside a commercial building",
                "time_of_day": "Night",
                "people_count": 2,
                "objects_detected": [
                    "car",
                    "trash can",
                    "streetlights",
                    "sidewalk",
                    "road",
                    "building",
                    "mattress/cushion"
                ],
                "activity_summary": "Two individuals run onto the scene. One continues off-camera while the other stops, picks up a mattress or large cushion from the sidewalk, and carries it away.",
                "description": "The surveillance footage, captured during the early morning hours on October 4th, 2015, shows a street corner illuminated by artificial lighting. The camera, labeled 'Camera 05', is positioned high on a building, looking down at a paved sidewalk and a curved road. Initially, two individuals are seen walking and then breaking into a run along the sidewalk. One person runs out of the frame to the left, while the second individual stops next to a public trash can. This person then bends down, lifts a large, white, rectangular object, which appears to be a mattress or a large cushion, and proceeds to carry it away in the same direction their companion ran. The entire action is completed in approximately 8 seconds.",
                "actors": [
                    "Individual in dark jacket and pants",
                    "Second individual in dark clothing"
                ],
                "suspicious_objects": [
                    "Mattress/cushion"
                ],
                "critical_level": "Medium",
                "chunk_time_range": "10.0s - 20.0s",
                "anomaly_reason": "The sequence was flagged due to the unusual and rapid action of an individual stealing a large object (a mattress or cushion) from a public sidewalk in the middle of the night. The preceding action of two individuals running onto the scene suggests a planned or hurried act, consistent with theft of property."
            },
            "chunk_metadata": {
                "chunk_index": 1,
                "start_time": 10.0,
                "end_time": 20.0,
                "duration": 10.0
            }
        },
        {
            "overall_scene": {
                "location": "Sidewalk and street corner outside a commercial building, likely in Sussex, UK.",
                "time_of_day": "Night (early morning)",
                "people_count": 1,
                "objects_detected": [
                    "person",
                    "cash register drawer/safe",
                    "building",
                    "sidewalk",
                    "street",
                    "trash can",
                    "streetlights"
                ],
                "activity_summary": "A man is seen running with a suspected stolen cash register drawer, trips, drops the item, and flees the scene.",
                "description": "The surveillance footage, recorded by 'Camera 05' on Sunday, October 4th, 2015, at approximately 03:45 AM, captures a nighttime scene on a well-lit sidewalk next to a street. A single individual, a man dressed in a dark suit or jacket and trousers, is observed running along the sidewalk away from a building. He is carrying a large, white, rectangular object consistent in appearance with a cash register drawer or a small safe. The man suddenly stumbles and falls, causing the object to drop onto the pavement. He quickly gets back up and continues to run away down the street, abandoning the object on the ground and exiting the camera's field of view. The scene suggests a hasty escape following a potential theft or burglary.",
                "actors": [
                    "Man in a dark suit"
                ],
                "suspicious_objects": [
                    "White rectangular object, likely a cash register drawer or small safe"
                ],
                "critical_level": "High",
                "chunk_time_range": "20.0s - 28.2s",
                "anomaly_reason": "A person is running from a location at 3:45 AM while carrying an object resembling a cash register drawer. The individual trips, abandons the object, and continues to flee, which is highly indicative of a theft or burglary."
            },
            "chunk_metadata": {
                "chunk_index": 2,
                "start_time": 20.0,
                "end_time": 28.166666666666668,
                "duration": 8.166666666666668
            }
        }
    ]
}